In [1]:
#Problem 1: Adding New Columns
#a) Create a column SquareOfMarks that stores the square of Marks for each student.
#b) Add a new column, Scholarship, with the value "Eligible" for students with Marks > 85 and "Not Eligible" otherwise.

#Problem 2: Sorting
#a) Sort the DataFrame by the Age column in descending order.
#b) Sort the DataFrame by City and then by Marks (both in ascending order).

#Problem 3: Filtering and Aggregating
#a) Find all Female students whose Marks are greater than 80.
#b) Calculate the average Age for students grouped by Gender.

#Problem 4: Handling Missing Data
#a) Simulate a missing Age value for "Bob".
#b) Replace the missing Age with the average Age of the remaining students.

#Bonus Question (Optional)
#a) Identify students from "Chicago" or "San Fransisco" and assign them a "SpecialCategory" column with "Yes".
#b) Write a custom function that assigns a Grade based on Marks:
#Marks > 90: Grade A
#80 ≤ Marks ≤ 90: Grade B
#Below 80: Grade C
#Add this as a new column Grade in your DataFrame.

'Problem 1: Adding New Columns\na) Create a column SquareOfMarks that stores the square of Marks for each student.\nb) Add a new column, Scholarship, with the value "Eligible" for students with Marks > 85 and "Not Eligible" otherwise.\n\nProblem 2: Sorting\na) Sort the DataFrame by the Age column in descending order.\nb) Sort the DataFrame by City and then by Marks (both in ascending order).\n\nProblem 3: Filtering and Aggregating\na) Find all Female students whose Marks are greater than 80.\nb) Calculate the average Age for students grouped by Gender.\n\nProblem 4: Handling Missing Data\na) Simulate a missing Age value for "Bob".\nb) Replace the missing Age with the average Age of the remaining students.\n\nBonus Question (Optional)\na) Identify students from "Chicago" or "San Fransisco" and assign them a "SpecialCategory" column with "Yes".\nb) Write a custom function that assigns a Grade based on Marks:\n\nMarks > 90: Grade A\n80 ≤ Marks ≤ 90: Grade B\nBelow 80: Grade C\nAdd this as a new column Grade in your DataFrame.'

In [2]:
import pandas as pd

In [3]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [4]:
def square(Marks):
    return Marks*Marks
vr["SquareofMarks"]=vr["Marks"].apply(square)

In [5]:
def scholarship(Marks):
    if Marks >85:
        return "Eligible"
    else:
        return "Not Eligible"
vr["Scholarship"]=vr["Marks"].apply(scholarship)

In [6]:
vr.sort_values(by="Age",ascending=False)

    Name  Age  Gender  Marks          City  SquareofMarks   Scholarship
1  Alice   22  Female     92   Los Angeles           8464      Eligible
3   Emma   21  Female     89  San Fransico           7921      Eligible
0   John   20    Male     88      New York           7744      Eligible
2    Bob   12    Male     75       Chicago           5625  Not Eligible

In [7]:
vr.sort_values(by=["City","Marks"],ascending=True)

    Name  Age  Gender  Marks          City  SquareofMarks   Scholarship
2    Bob   12    Male     75       Chicago           5625  Not Eligible
1  Alice   22  Female     92   Los Angeles           8464      Eligible
0   John   20    Male     88      New York           7744      Eligible
3   Emma   21  Female     89  San Fransico           7921      Eligible

In [8]:
vr.loc[(vr["Gender"]=="Female")&(vr["Marks"]>80)]

    Name  Age  Gender  Marks          City  SquareofMarks Scholarship
1  Alice   22  Female     92   Los Angeles           8464    Eligible
3   Emma   21  Female     89  San Fransico           7921    Eligible

In [9]:
vr.groupby("Gender")["Age"].mean()

Gender
Female    21.5
Male      16.0
Name: Age, dtype: float64

In [10]:
import numpy as np
vr.loc[vr["Name"]=="Bob","Age"]=np.nan
vr

    Name   Age  Gender  Marks          City  SquareofMarks   Scholarship
0   John  20.0    Male     88      New York           7744      Eligible
1  Alice  22.0  Female     92   Los Angeles           8464      Eligible
2    Bob   NaN    Male     75       Chicago           5625  Not Eligible
3   Emma  21.0  Female     89  San Fransico           7921      Eligible

In [11]:
vr["Age"] = vr["Age"].fillna(vr["Age"].mean())
vr

    Name   Age  Gender  Marks          City  SquareofMarks   Scholarship
0   John  20.0    Male     88      New York           7744      Eligible
1  Alice  22.0  Female     92   Los Angeles           8464      Eligible
2    Bob  21.0    Male     75       Chicago           5625  Not Eligible
3   Emma  21.0  Female     89  San Fransico           7921      Eligible

In [12]:
def category(City):
    if City=="Chicago"or City=="San Fransico":
        return "Yes"
    else:
        return "no"
vr["SpecialCategory"]=vr["City"].apply(category)

In [13]:
def grade(Marks):
    if Marks>90:
        return "A"
    elif Marks>80:
        return "B"
    else:
        return "C"

vr["Grade"]=vr["Marks"].apply(grade)